tsung/signed_in_user/badge_earner.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" dumptraffic="true" version="1.0">

  <clients>
    <client host="localhost" maxusers="1" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="bl-staging-mango.herokuapp.com" port="443" type="ssl"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="10" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="10" unit="second"/>
    </arrivalphase>
  </load>

  <sessions>

    <session name="http_test_1" probability="100" type="ts_http">

      <request >
        <dyn_variable name="authenticity_token"/>
        <dyn_variable name="utf8" />
        <http url='/users/sign_in' version='1.1' method='GET'>
        </http>
      </request>

      <thinktime random='true' value='5'/>

      <request subst="true">
        <http url="/users/sign_in" contents='{&quot;utf8&quot;: &quot;%%_utf8%%&quot;, &quot;authenticity_token&quot;: &quot;%%_authenticity_token%%&quot;, "user": {&quot;email&quot;: &quot; vishal.jagtap+22@zibtek.com&quot;,&quot;password&quot;: &quot;tudip123&quot;}}' content_type='application/json' method="POST" version="1.1">
        </http>
      </request>

      <thinktime value="5" random="true"></thinktime>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <http url='/community' version='1.1' method='GET'>
        </http>
      </request>

      <thinktime random='true' value='5'/>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <http url="/community/join" contents='{&quot;_method&quot;: &quot;post&quot;, &quot;authenticity_token&quot;: &quot;%%_authenticity_token%%&quot;}' content_type='application/json' method="POST" version="1.1">
        </http>
      </request>

      <thinktime value="5" random="true"></thinktime>

      <request subst="true">
        <http url='/community/Badge-Builder' version='1.1' method='GET'>
        </http>
      </request>

      <thinktime random='true' value='5'/>

      <request subst="true">
        <http url="/community/Badge-Builder/join" method="GET" version="1.1">
        </http>
      </request>

      <thinktime random='true' value='5'/>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <dyn_variable name="utf8" />
        <http url="/community/Badge-Builder/u/vishal22/entries/new?tag=Create-a-learning-group" method="GET" version="1.1">
        </http>
      </request>

      <thinktime random='true' value='5'/>

      <request subst="true">
        <http url="/community/Badge-Builder/u/vishal22/entries" contents='{&quot;utf8&quot;: &quot;%%_utf8%%&quot;, &quot;authenticity_token&quot;: &quot;%%_authenticity_token%%&quot;, "entry": {&quot;link_url&quot;: &quot;https://www.w3schools.com/js/&quot;, &quot;summary&quot;: &quot;testing 111111&quot;, &quot;type&quot;: &quot;post&quot;, &quot;format&quot;: &quot; link&quot;, &quot;parent_tag&quot;: &quot;Create-a-learning-group&quot;}}' content_type='application/json' method="POST" version="1.1">
        </http>
      </request>

      <thinktime random='true' value='5'/>

      <request subst="true">           
        <dyn_variable name="request_feedback_url" xpath="//a[@class='btn btn-small highlight-primary']/@href" />
        <dyn_variable name="_method"/>
        <dyn_variable name="authenticity_token"/>                    
        <http url="/community/Badge-Builder/u/vishal22" method="GET" version="1.1">
        </http>
      </request>

      <thinktime random='true' value='5'/>

      <request subst="true">
        <http url="%%_request_feedback_url%%" contents='{&quot;_method&quot;: &quot;%%__method%%&quot;, &quot;authenticity_token&quot;: &quot;%%_authenticity_token%%&quot;}' content_type='application/json'  method="PUT" version="1.1">
        </http>
      </request>
    </session>
  </sessions>
</tsung>